archive/before-2018-11-10/2018-07-31-syslog导致的死锁.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2018-07-31-syslog导致的死锁</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2018-07-31-syslog导致的死锁</h1>
<p>
我写了一个程序，启动两个线程，t1和t2,线程通过互斥量进行同步。
</p>

<p>
线程t1是主线程，满足条件通过互斥量通知t2,t2线程进行fork()。子进程处理
业务。父进程使用waitpid等待子进程执行完毕。
</p>

<p>
导致该问题的一原因是syslog不是可重入的函数，它里面是有一把锁 <code>mutex S</code>
的，查资料说是因为它下面调用了malloc，malloc是不可重入的。出问题的情况
可能如下：
</p>
<ol class="org-ol">
<li>thread 1在通知thread 2后，自已也会调用syslog接口来写日志。</li>
<li>当thread 1正在调syslog写日志的时候，thread 2执行了fork。</li>
<li>这时如果 thread 1这边调用syslog刚好锁住了 <code>mutex S</code> 。此时fork出来
的子进程中的这把锁可能是一直都锁住的。这样的话，子进程只要调用
syslog来写日志都会卡住。因为锁 <code>mutex S</code> 一直是锁住的。</li>
</ol>

<div class="org-src-container">
<pre class="src src-artist">     +------------+        +----------+                                          
     |            |        |          |             +-------------------------------+
     |            |        |          |           /&gt;|  child process: syslog(XXXXXX)|
     |            |        |          |        /--  +-------------------------------+
     | thread 1   |        | thread 2 |    /---    
     |            |        |          | /--        
     |            |        |         /+-           
     | signal-----+--------+&gt;fork()---|
     |            |        |          \---
     |            |        |          |   \---
     | syslog(XXX)|        |          |       \---  +------------------------------+
     |            |        |          |           \&gt;|  parrent process: waitpid()  |
     |            |        |          |             +------------------------------+
     |            |        |          |                                             
     +------------+        +----------+                                             
</pre>
</div>

<p>
附：两个线程同步使用的是互斥量。参考的《UNIX环境高级编程》写的。死锁的
伪码如下：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00d7af;">pthread_cond_t</span> <span style="color: #ff8700;">qready</span> = PTHREAD_COND_INITIALIZER;
<span style="color: #00d7af;">pthread_mutex_t</span> <span style="color: #ff8700;">qlock</span> = PTHREAD_MUTEX_INITIALIZER;

<span style="color: #ffd700;">thread1</span>()
{
    <span style="color: #a1db00;">while</span>(1)
    {
        pthread_mutex_lock(&amp;qlock);
        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">... </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
        pthread_mutex_unlock(&amp;qlock);
        pthread_cond_signal(&amp;qready);

        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">&#22312;&#20889;&#36825;&#26465;&#26085;&#24535;&#26102;thread2&#36827;&#34892;&#20102;fork </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
        syslog(<span style="color: #ff4ea3;">"This is in thread1\n"</span>);
    }
}

<span style="color: #ffd700;">thread2</span>()
{
    pthread_mutex_lock(&amp;qlock);

    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">&#25105;&#29702;&#35299;&#65306;&#36825;&#37324;wait&#30340;&#26102;&#20505;&#20250;&#37322;&#25918;&#20114;&#26021;&#37327;&#65292;&#31561;&#21478;&#22806;&#30340;&#32447;&#31243;&#36890;&#36807;</span>
<span style="color: #6c6c6c; font-style: italic;">     * `pthread_cond_signal'&#21796;&#37266;&#26465;&#20214;&#21464;&#37327;&#26102;&#20877;&#38145;&#20303;&#20114;&#26021;&#37327;&#24448;&#19979;&#36208;&#65292;&#36825;&#26679;&#21487;&#20197;</span>
<span style="color: #6c6c6c; font-style: italic;">     * &#20445;&#27491;&#19979;&#38754;&#35775;&#38382;&#30340;&#20020;&#30028;&#36164;&#28304;&#19981;&#20914;&#31361;&#12290; </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
    pthread_cond_wait(&amp;qready, &amp;qlock);
    
    pid = fork();

    <span style="color: #a1db00;">if</span> (pid == 0)
    {
        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">child </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
        syslog(<span style="color: #ff4ea3;">"child may be locked here\n"</span>);
    }
    <span style="color: #a1db00;">else</span>
    {
        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">parrent </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
        waitpid(pid);
    }
    
    pthread_mutex_unlock(&amp;qlock);
}
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>